# coding=utf-8

import random


arc = ["現在の社会が崩壊した数年後","現在の社会が崩壊した10年後","現在の社会が崩壊した30年後","現在の社会が崩壊した60年後","現在の社会が崩壊した100年後","現在の社会を規律で抑圧した数年後","現在の社会を規律で抑圧した10年後","現在の社会を規律で抑圧した30年後","現在の社会を規律で抑圧した60年後","現在の社会を規律で抑圧した100年後","現在の社会が成長した数年後","現在の社会が成長した10年後","現在の社会が成長した30年後","現在の社会が成長した60年後","現在の社会が成長した100年後","現在の社会が著しく変化した数年後","現在の社会が著しく変化した10年後","現在の社会が著しく変化した30年後","現在の社会が著しく変化した60年後","現在の社会が著しく変化した100年後"]
terrain =["農業","脳","幼年時代","市民権","階級","気候","クローン術","コミュニケーション","裁判所","病","ドローン","経済","教育","エンターテインメント","環境","平等・公平","家族","ファッション","森林","遺伝子","性別","政治・統治","フライト(飛行機)","健康","趣味","家、家庭","アイデンティティ","虫類","知的財産","ジャーナリズム","正義","学習","記憶","採掘","月","音楽","海洋","石油","高齢","ペット","権力","宗教","ロボット","性行為","買い物","宇宙","スポーツ","劇場","旅行","戦争","水","富","女性","仕事","ゾンビ","動物園"]
objects =["広告","美術品","飲み物","本","ボトル","箱","パンフレット","建物","飴","洋服","企業","デバイス端末","書類","イベント","お祭り","旗","ゲーム","贈り物","インプラント(体内に埋め込む器具)","楽器","ジュエリー","キット","見出し","法律","ロゴマーク","保湿クリーム","機械","雑誌の表紙","地図","仮面","記念碑","パスポート","錠剤","植物","絵葉書","ポスター","商品","補綴(ほてつ)（入れ歯、ペースメーカー、義足など人工器官）","公共サービス情報","古物（遺物）","儀式","公演","スローガン（標語）","お菓子","歌","お土産","銅像","シール","シンボル","Tシャツ","刺青","工具","おもちゃ","乗り物","ビデオ","武器"]
mood = ["感嘆","疎外感","愉快","怒り","不安","気まずい","落ち着き","魅了","朗らか","満足","好奇心","退廃","歓喜","尊厳","嫌悪","恐ろしい","恥ずかしい","興奮","魅了","熱意","苛立ち（欲求不満）","感謝","爽快感","幸福","陽気にはしゃぐ","希望感","欲求","病的","憂鬱","メロドラマ(感傷的な恋愛)","懐かしさ","楽観","怒り（暴力的）","哀感","快楽","誇り","合理性","安堵","恨み","尊敬","悲しみ","満足感","平静","恥辱","衝撃","悲しみ","驚き","不快感","温かさ","奇妙","幸福","不思議","心配","禅"]


print("時代背景:" + random.choice(arc))
print("製品に関するテーマ:" + random.choice(terrain))
print("想像する製品や技術:" + random.choice(objects))
print("利用により得られる感情:" + random.choice(mood))


            













